{
  "run_id": "d6bb2d38-d70d-4769-89b8-bb1794e82bd0",
  "extraction_agent_id": "f5b84b64-a15a-45df-a791-264b61899c0e",
  "data": {
    "alarms": [
      {
        "baseMessage": "AC POWER LOSS",
        "analysisMessage": "The power switch is ON, AC power is not available, and the ventilator is being powered by the backup power source (BPS).",
        "remedyMessage": "Prepare for power loss. Obtain alternate ventilation. Check integrity of AC power source. Contact service if necessary.",
        "comments": ""
      },
      {
        "baseMessage": "APNEA",
        "analysisMessage": "The set apnea interval has elapsed without the ventilator, patient or operator triggering a breath.",
        "remedyMessage": "Check patient and settings.",
        "comments": ""
      },
      {
        "baseMessage": "CIRCUIT DISCONNECT",
        "analysisMessage": "There is a disconnection in the patient circuit before the patient wye or patient disconnect is detected following power restoration from an unintentional power loss with the power switch ON.",
        "remedyMessage": "Check patient. Reconnect patient circuit. Press ALARM RESET.",
        "comments": ""
      },
      {
        "baseMessage": "COMPRESSOR INOPERATIVE",
        "analysisMessage": "Compressor cannot maintain sufficient supply pressure.",
        "remedyMessage": "Check patient. Obtain alternate ventilation. Remove ventilator from use and contact service.",
        "comments": ""
      },
      {
        "baseMessage": "DEVICE ALERT",
        "analysisMessage": "A background test or power on self-test (POST) has detected a problem.",
        "remedyMessage": "Check patient. If prompted to do so, obtain alternate ventilation or contact service.",
        "comments": ""
      },
      {
        "baseMessage": "O₂ SENSOR",
        "analysisMessage": "Background checks have detected a problem with the O₂ sensor.",
        "remedyMessage": "O₂ sensor is out of calibration or has failed. Press 100% O₂ CAL; replace or disable the sensor.",
        "comments": ""
      },
      {
        "baseMessage": "PCIRC (High circuit pressure)",
        "analysisMessage": "The measured airway pressure is equal to or greater than the set limit. Reduced tidal volume likely.",
        "remedyMessage": "Check patient, patient circuit and endotracheal tube.",
        "comments": ""
      },
      {
        "baseMessage": "O₂% (High delivered O₂%)",
        "analysisMessage": "The O₂% measured during any phase of a breath cycle is 7% (12% during the first hour of operation) or more above the O₂% setting for at least 30 seconds. (These percentages increase by 5% for four minutes following a decrease in the O₂% setting.)",
        "remedyMessage": "Check patient, air and oxygen supplies, oxygen analyzer and ventilator.",
        "comments": ""
      },
      {
        "baseMessage": "VTE (High exhaled tidal volume)",
        "analysisMessage": "The patient's exhaled tidal volume for any breath is equal to or greater than the set limit.",
        "remedyMessage": "Check patient and settings. Consider whether the patient’s compliance or resistance has changed.",
        "comments": ""
      },
      {
        "baseMessage": "VE TOT (High exhaled total minute volume)",
        "analysisMessage": "The patient's expiratory minute volume is equal to or greater than the set limit.",
        "remedyMessage": "Check patient and settings.",
        "comments": ""
      },
      {
        "baseMessage": "Vti SPONT Alarm",
        "analysisMessage": "The delivered volume of any tube compensated (TC) breath is equal to or greater than the inspired tidal volume limit. Ventilator transitions to exhalation.",
        "remedyMessage": "Check patient. Check for leaks, tube type/I.D. setting.",
        "comments": ""
      },
      {
        "baseMessage": "fTOT (High respiratory rate)",
        "analysisMessage": "The breath rate from all breaths is greater than or equal to the set limit.",
        "remedyMessage": "Check patient and settings.",
        "comments": ""
      },
      {
        "baseMessage": "PVENT (High internal ventilator pressure)",
        "analysisMessage": "The inspiratory pressure transducer has measured a pressure of at least 100 cm H₂O. Active only during volume-controlled breaths. Ventilator transitions to exhalation. Reduced tidal volume likely.",
        "remedyMessage": "Check patient. Obtain alternate ventilation. Remove ventilator from use and contact service.",
        "comments": ""
      },
      {
        "baseMessage": "PCOMP",
        "analysisMessage": "The target pressure of a tube compensated (TC) breath equals the PCIRC limit. This limit is equal to the setting of P PEAK. Inspiration pressure is limited during this alarm.",
        "remedyMessage": "Check patient. Check for leaks, tube type/I.D. setting.",
        "comments": ""
      },
      {
        "baseMessage": "INOPERATIVE BATTERY",
        "analysisMessage": "BPS is installed but not functioning.",
        "remedyMessage": "Contact service.",
        "comments": ""
      },
      {
        "baseMessage": "INSPIRATION TOO LONG",
        "analysisMessage": "IBW-based inspiratory time for a spontaneous breath exceeds ventilator-set limit.",
        "remedyMessage": "Check patient. Check for leaks.",
        "comments": ""
      },
      {
        "baseMessage": "LOSS OF POWER",
        "analysisMessage": "The ventilator power switch is on and there is insufficient power from the AC supply and the BPS. There may not be a visual indicator for this alarm, but an independent audio alarm sounds for at least 120 seconds.",
        "remedyMessage": "Check integrity of AC power and BPS connections. Obtain alternate ventilation.",
        "comments": ""
      },
      {
        "baseMessage": "LOW AC POWER",
        "analysisMessage": "Mains AC power has dropped below 80% of nominal voltage for at least one second. Warns that AC power has dropped significantly, and that a more severe power drop may be imminent. The ventilator turns off the compressor (if installed), and otherwise operates normally.",
        "remedyMessage": "Check integrity of connection to AC power. Check AC power supply.",
        "comments": ""
      },
      {
        "baseMessage": "LOW BATTERY",
        "analysisMessage": "The BPS has less than approximately two minutes of operational time remaining.",
        "remedyMessage": "Replace BPS or allow it to recharge during normal ventilator operation.",
        "comments": ""
      },
      {
        "baseMessage": "↓O₂% (Low delivered O₂%)",
        "analysisMessage": "The O₂% measured during any phase of a breath cycle is 7% (12% during the first hour of operation) or more below the O₂% setting for at least 30 seconds, or below 18%. (These percentages increase by 5% for four minutes following an increase in the O₂% setting.)",
        "remedyMessage": "Check patient, air and oxygen supplies, oxygen analyzer and ventilator. Calibrate oxygen sensor (press 100% O₂/CAL 2 min key).",
        "comments": ""
      },
      {
        "baseMessage": "↓VTE MAND (Low exhaled mandatory tidal volume)",
        "analysisMessage": "The patient's exhaled mandatory tidal volume is less than or equal to the set limit.",
        "remedyMessage": "Check patient. Check for leaks or changes in the patient’s resistance or compliance.",
        "comments": ""
      },
      {
        "baseMessage": "↓VTE SPONT (Low exhaled spontaneous tidal volume)",
        "analysisMessage": "The patient's exhaled spontaneous tidal volume is less than or equal to the set limit.",
        "remedyMessage": "Check patient and settings.",
        "comments": ""
      },
      {
        "baseMessage": "↓VE TOT (Low exhaled total minute volume)",
        "analysisMessage": "The minute volume for all breaths is less than or equal to the set limit.",
        "remedyMessage": "Check patient and settings.",
        "comments": ""
      },
      {
        "baseMessage": "NO AIR SUPPLY",
        "analysisMessage": "Air supply pressure is less than the minimum required pressure for correct ventilator operation throughout its range of flows. Accurate O₂% delivery may be compromised. You cannot set or disable the NO AIR SUPPLY alarm.",
        "remedyMessage": "Check patient and air source. Obtain alternate ventilation.",
        "comments": ""
      },
      {
        "baseMessage": "NO O₂ supply",
        "analysisMessage": "Oxygen supply pressure is less than the minimum required pressure for correct ventilator operation throughout its range of flows. Accurate O₂% delivery may be compromised. You cannot set or disable the NO O₂ SUPPLY alarm.",
        "remedyMessage": "Check patient and oxygen source. Obtain alternate ventilation.",
        "comments": ""
      },
      {
        "baseMessage": "PROCEDURE ERROR",
        "analysisMessage": "Patient attached before ventilator startup is complete. Safety ventilation is active.",
        "remedyMessage": "Provide alternate ventilation. Complete ventilator startup procedure.",
        "comments": ""
      },
      {
        "baseMessage": "SEVERE OCCLUSION",
        "analysisMessage": "Patient circuit is severely occluded.",
        "remedyMessage": "Check patient. Obtain alternate ventilation if necessary. Check patient circuit for crimps, blocked filter. If problem persists, remove ventilator from use and contact service.",
        "comments": ""
      }
    ]
  },
  "extraction_metadata": {
    "field_metadata": {
      
    },
    "usage": {
      "num_pages_extracted": 6,
      "num_document_tokens": 1967,
      "num_output_tokens": 1563
    }
  }
}